{
  "backend": "tokenizers",
  "boi_token": "<start_of_image>",
  "bos_token": "<bos>",
  "clean_up_tokenization_spaces": false,
  "eoi_token": "<end_of_image>",
  "eos_token": "<eos>",
  "image_token": "<image_soft_token>",
  "is_local": true,
  "mask_token": "<mask>",
  "model_max_length": 1000000000000000019884624838656,
  "model_specific_special_tokens": {
    "boi_token": "<start_of_image>",
    "eoi_token": "<end_of_image>",
    "image_token": "<image_soft_token>"
  },
  "pad_token": "<pad>",
  "padding_side": "left",
  "processor_class": "Gemma3Processor",
  "sp_model_kwargs": null,
  "spaces_between_special_tokens": false,
  "tokenizer_class": "GemmaTokenizer",
  "unk_token": "<unk>",
  "use_default_system_prompt": false,
  "chat_template": "{%- set languages = {\n    \"aa\": \"Afar\",\n    \"aa-DJ\": \"Afar\",\n    \"aa-ER\": \"Afar\",\n    \"ab\": \"Abkhazian\",\n    \"af\": \"Afrikaans\",\n    \"af-NA\": \"Afrikaans\",\n    \"ak\": \"Akan\",\n    \"am\": \"Amharic\",\n    \"an\": \"Aragonese\",\n    \"ar\": \"Arabic\",\n    \"ar-AE\": \"Arabic\",\n    \"ar-BH\": \"Arabic\",\n    \"ar-DJ\": \"Arabic\",\n    \"ar-DZ\": \"Arabic\",\n    \"ar-EG\": \"Arabic\",\n    \"ar-EH\": \"Arabic\",\n    \"ar-ER\": \"Arabic\",\n    \"ar-IL\": \"Arabic\",\n    \"ar-IQ\": \"Arabic\",\n    \"ar-JO\": \"Arabic\",\n    \"ar-KM\": \"Arabic\",\n    \"ar-KW\": \"Arabic\",\n    \"ar-LB\": \"Arabic\",\n    \"ar-LY\": \"Arabic\",\n    \"ar-MA\": \"Arabic\",\n    \"ar-MR\": \"Arabic\",\n    \"ar-OM\": \"Arabic\",\n    \"ar-PS\": \"Arabic\",\n    \"ar-QA\": \"Arabic\",\n    \"ar-SA\": \"Arabic\",\n    \"ar-SD\": \"Arabic\",\n    \"ar-SO\": \"Arabic\",\n    \"ar-SS\": \"Arabic\",\n    \"ar-SY\": \"Arabic\",\n    \"ar-TD\": \"Arabic\",\n    \"ar-TN\": \"Arabic\",\n    \"ar-YE\": \"Arabic\",\n    \"as\": \"Assamese\",\n    \"az\": \"Azerbaijani\",\n    \"az-Arab\": \"Azerbaijani\",\n    \"az-Arab-IQ\": \"Azerbaijani\",\n    \"az-Arab-TR\": \"Azerbaijani\",\n    \"az-Cyrl\": \"Azerbaijani\",\n    \"az-Latn\": \"Azerbaijani\",\n    \"ba\": \"Bashkir\",\n    \"be\": \"Belarusian\",\n    \"be-tarask\": \"Belarusian\",\n    \"bg\": \"Bulgarian\",\n    \"bg-BG\": \"Bulgarian\",\n    \"bm\": \"Bambara\",\n    \"bm-Nkoo\": \"Bambara\",\n    \"bn\": \"Bengali\",\n    \"bn-IN\": \"Bengali\",\n    \"bo\": \"Tibetan\",\n    \"bo-IN\": \"Tibetan\",\n    \"br\": \"Breton\",\n    \"bs\": \"Bosnian\",\n    \"bs-Cyrl\": \"Bosnian\",\n    \"bs-Latn\": \"Bosnian\",\n    \"ca\": \"Catalan\",\n    \"ca-AD\": \"Catalan\",\n    \"ca-ES\": \"Catalan\",\n    \"ca-FR\": \"Catalan\",\n    \"ca-IT\": \"Catalan\",\n    \"ce\": \"Chechen\",\n    \"co\": \"Corsican\",\n    \"cs\": \"Czech\",\n    \"cs-CZ\": \"Czech\",\n    \"cv\": \"Chuvash\",\n    \"cy\": \"Welsh\",\n    \"da\": \"Danish\",\n    \"da-DK\": \"Danish\",\n    \"da-GL\": \"Danish\",\n    \"de\": \"German\",\n    \"de-AT\": \"German\",\n    \"de-BE\": \"German\",\n    \"de-CH\": \"German\",\n    \"de-DE\": \"German\",\n    \"de-IT\": \"German\",\n    \"de-LI\": \"German\",\n    \"de-LU\": \"German\",\n    \"dv\": \"Divehi\",\n    \"dz\": \"Dzongkha\",\n    \"ee\": \"Ewe\",\n    \"ee-TG\": \"Ewe\",\n    \"el\": \"Greek\",\n    \"el-CY\": \"Greek\",\n    \"el-GR\": \"Greek\",\n    \"el-polyton\": \"Greek\",\n    \"en\": \"English\",\n    \"en-AE\": \"English\",\n    \"en-AG\": \"English\",\n    \"en-AI\": \"English\",\n    \"en-AS\": \"English\",\n    \"en-AT\": \"English\",\n    \"en-AU\": \"English\",\n    \"en-BB\": \"English\",\n    \"en-BE\": \"English\",\n    \"en-BI\": \"English\",\n    \"en-BM\": \"English\",\n    \"en-BS\": \"English\",\n    \"en-BW\": \"English\",\n    \"en-BZ\": \"English\",\n    \"en-CA\": \"English\",\n    \"en-CC\": \"English\",\n    \"en-CH\": \"English\",\n    \"en-CK\": \"English\",\n    \"en-CM\": \"English\",\n    \"en-CX\": \"English\",\n    \"en-CY\": \"English\",\n    \"en-CZ\": \"English\",\n    \"en-DE\": \"English\",\n    \"en-DG\": \"English\",\n    \"en-DK\": \"English\",\n    \"en-DM\": \"English\",\n    \"en-ER\": \"English\",\n    \"en-ES\": \"English\",\n    \"en-FI\": \"English\",\n    \"en-FJ\": \"English\",\n    \"en-FK\": \"English\",\n    \"en-FM\": \"English\",\n    \"en-FR\": \"English\",\n    \"en-GB\": \"English\",\n    \"en-GD\": \"English\",\n    \"en-GG\": \"English\",\n    \"en-GH\": \"English\",\n    \"en-GI\": \"English\",\n    \"en-GM\": \"English\",\n    \"en-GS\": \"English\",\n    \"en-GU\": \"English\",\n    \"en-GY\": \"English\",\n    \"en-HK\": \"English\",\n    \"en-HU\": \"English\",\n    \"en-ID\": \"English\",\n    \"en-IE\": \"English\",\n    \"en-IL\": \"English\",\n    \"en-IM\": \"English\",\n    \"en-IN\": \"English\",\n    \"en-IO\": \"English\",\n    \"en-IT\": \"English\",\n    \"en-JE\": \"English\",\n    \"en-JM\": \"English\",\n    \"en-KE\": \"English\",\n    \"en-KI\": \"English\",\n    \"en-KN\": \"English\",\n    \"en-KY\": \"English\",\n    \"en-LC\": \"English\",\n    \"en-LR\": \"English\",\n    \"en-LS\": \"English\",\n    \"en-MG\": \"English\",\n    \"en-MH\": \"English\",\n    \"en-MO\": \"English\",\n    \"en-MP\": \"English\",\n    \"en-MS\": \"English\",\n    \"en-MT\": \"English\",\n    \"en-MU\": \"English\",\n    \"en-MV\": \"English\",\n    \"en-MW\": \"English\",\n    \"en-MY\": \"English\",\n    \"en-NA\": \"English\",\n    \"en-NF\": \"English\",\n    \"en-NG\": \"English\",\n    \"en-NL\": \"English\",\n    \"en-NO\": \"English\",\n    \"en-NR\": \"English\",\n    \"en-NU\": \"English\",\n    \"en-NZ\": \"English\",\n    \"en-PG\": \"English\",\n    \"en-PH\": \"English\",\n    \"en-PK\": \"English\",\n    \"en-PL\": \"English\",\n    \"en-PN\": \"English\",\n    \"en-PR\": \"English\",\n    \"en-PT\": \"English\",\n    \"en-PW\": \"English\",\n    \"en-RO\": \"English\",\n    \"en-RW\": \"English\",\n    \"en-SB\": \"English\",\n    \"en-SC\": \"English\",\n    \"en-SD\": \"English\",\n    \"en-SE\": \"English\",\n    \"en-SG\": \"English\",\n    \"en-SH\": \"English\",\n    \"en-SI\": \"English\",\n    \"en-SK\": \"English\",\n    \"en-SL\": \"English\",\n    \"en-SS\": \"English\",\n    \"en-SX\": \"English\",\n    \"en-SZ\": \"English\",\n    \"en-TC\": \"English\",\n    \"en-TK\": \"English\",\n    \"en-TO\": \"English\",\n    \"en-TT\": \"English\",\n    \"en-TV\": \"English\",\n    \"en-TZ\": \"English\",\n    \"en-UG\": \"English\",\n    \"en-UM\": \"English\",\n    \"en-VC\": \"English\",\n    \"en-VG\": \"English\",\n    \"en-VI\": \"English\",\n    \"en-VU\": \"English\",\n    \"en-WS\": \"English\",\n    \"en-ZA\": \"English\",\n    \"en-ZM\": \"English\",\n    \"en-ZW\": \"English\",\n    \"eo\": \"Esperanto\",\n    \"es\": \"Spanish\",\n    \"es-AR\": \"Spanish\",\n    \"es-BO\": \"Spanish\",\n    \"es-BR\": \"Spanish\",\n    \"es-BZ\": \"Spanish\",\n    \"es-CL\": \"Spanish\",\n    \"es-CO\": \"Spanish\",\n    \"es-CR\": \"Spanish\",\n    \"es-CU\": \"Spanish\",\n    \"es-DO\": \"Spanish\",\n    \"es-EA\": \"Spanish\",\n    \"es-EC\": \"Spanish\",\n    \"es-ES\": \"Spanish\",\n    \"es-GQ\": \"Spanish\",\n    \"es-GT\": \"Spanish\",\n    \"es-HN\": \"Spanish\",\n    \"es-IC\": \"Spanish\",\n    \"es-MX\": \"Spanish\",\n    \"es-NI\": \"Spanish\",\n    \"es-PA\": \"Spanish\",\n    \"es-PE\": \"Spanish\",\n    \"es-PH\": \"Spanish\",\n    \"es-PR\": \"Spanish\",\n    \"es-PY\": \"Spanish\",\n    \"es-SV\": \"Spanish\",\n    \"es-US\": \"Spanish\",\n    \"es-UY\": \"Spanish\",\n    \"es-VE\": \"Spanish\",\n    \"et\": \"Estonian\",\n    \"et-EE\": \"Estonian\",\n    \"eu\": \"Basque\",\n    \"fa\": \"Persian\",\n    \"fa-AF\": \"Persian\",\n    \"fa-IR\": \"Persian\",\n    \"ff\": \"Fulah\",\n    \"ff-Adlm\": \"Fulah\",\n    \"ff-Adlm-BF\": \"Fulah\",\n    \"ff-Adlm-CM\": \"Fulah\",\n    \"ff-Adlm-GH\": \"Fulah\",\n    \"ff-Adlm-GM\": \"Fulah\",\n    \"ff-Adlm-GW\": \"Fulah\",\n    \"ff-Adlm-LR\": \"Fulah\",\n    \"ff-Adlm-MR\": \"Fulah\",\n    \"ff-Adlm-NE\": \"Fulah\",\n    \"ff-Adlm-NG\": \"Fulah\",\n    \"ff-Adlm-SL\": \"Fulah\",\n    \"ff-Adlm-SN\": \"Fulah\",\n    \"ff-Latn\": \"Fulah\",\n    \"ff-Latn-BF\": \"Fulah\",\n    \"ff-Latn-CM\": \"Fulah\",\n    \"ff-Latn-GH\": \"Fulah\",\n    \"ff-Latn-GM\": \"Fulah\",\n    \"ff-Latn-GN\": \"Fulah\",\n    \"ff-Latn-GW\": \"Fulah\",\n    \"ff-Latn-LR\": \"Fulah\",\n    \"ff-Latn-MR\": \"Fulah\",\n    \"ff-Latn-NE\": \"Fulah\",\n    \"ff-Latn-NG\": \"Fulah\",\n    \"ff-Latn-SL\": \"Fulah\",\n    \"fi\": \"Finnish\",\n    \"fi-FI\": \"Finnish\",\n    \"fil-PH\": \"Filipino\",\n    \"fo\": \"Faroese\",\n    \"fo-DK\": \"Faroese\",\n    \"fr\": \"French\",\n    \"fr-BE\": \"French\",\n    \"fr-BF\": \"French\",\n    \"fr-BI\": \"French\",\n    \"fr-BJ\": \"French\",\n    \"fr-BL\": \"French\",\n    \"fr-CA\": \"French\",\n    \"fr-CD\": \"French\",\n    \"fr-CF\": \"French\",\n    \"fr-CG\": \"French\",\n    \"fr-CH\": \"French\",\n    \"fr-CI\": \"French\",\n    \"fr-CM\": \"French\",\n    \"fr-DJ\": \"French\",\n    \"fr-DZ\": \"French\",\n    \"fr-FR\": \"French\",\n    \"fr-GA\": \"French\",\n    \"fr-GF\": \"French\",\n    \"fr-GN\": \"French\",\n    \"fr-GP\": \"French\",\n    \"fr-GQ\": \"French\",\n    \"fr-HT\": \"French\",\n    \"fr-KM\": \"French\",\n    \"fr-LU\": \"French\",\n    \"fr-MA\": \"French\",\n    \"fr-MC\": \"French\",\n    \"fr-MF\": \"French\",\n    \"fr-MG\": \"French\",\n    \"fr-ML\": \"French\",\n    \"fr-MQ\": \"French\",\n    \"fr-MR\": \"French\",\n    \"fr-MU\": \"French\",\n    \"fr-NC\": \"French\",\n    \"fr-NE\": \"French\",\n    \"fr-PF\": \"French\",\n    \"fr-PM\": \"French\",\n    \"fr-RE\": \"French\",\n    \"fr-RW\": \"French\",\n    \"fr-SC\": \"French\",\n    \"fr-SN\": \"French\",\n    \"fr-SY\": \"French\",\n    \"fr-TD\": \"French\",\n    \"fr-TG\": \"French\",\n    \"fr-TN\": \"French\",\n    \"fr-VU\": \"French\",\n    \"fr-WF\": \"French\",\n    \"fr-YT\": \"French\",\n    \"fy\": \"Western Frisian\",\n    \"ga\": \"Irish\",\n    \"ga-GB\": \"Irish\",\n    \"gd\": \"Scottish Gaelic\",\n    \"gl\": \"Galician\",\n    \"gn\": \"Guarani\",\n    \"gu\": \"Gujarati\",\n    \"gu-IN\": \"Gujarati\",\n    \"gv\": \"Manx\",\n    \"ha\": \"Hausa\",\n    \"ha-Arab\": \"Hausa\",\n    \"ha-Arab-SD\": \"Hausa\",\n    \"ha-GH\": \"Hausa\",\n    \"ha-NE\": \"Hausa\",\n    \"he\": \"Hebrew\",\n    \"he-IL\": \"Hebrew\",\n    \"hi\": \"Hindi\",\n    \"hi-IN\": \"Hindi\",\n    \"hi-Latn\": \"Hindi\",\n    \"hr\": \"Croatian\",\n    \"hr-BA\": \"Croatian\",\n    \"hr-HR\": \"Croatian\",\n    \"ht\": \"Haitian\",\n    \"hu\": \"Hungarian\",\n    \"hu-HU\": \"Hungarian\",\n    \"hy\": \"Armenian\",\n    \"ia\": \"Interlingua\",\n    \"id\": \"Indonesian\",\n    \"id-ID\": \"Indonesian\",\n    \"ie\": \"Interlingue\",\n    \"ig\": \"Igbo\",\n    \"ii\": \"Sichuan Yi\",\n    \"ik\": \"Inupiaq\",\n    \"io\": \"Ido\",\n    \"is\": \"Icelandic\",\n    \"it\": \"Italian\",\n    \"it-CH\": \"Italian\",\n    \"it-IT\": \"Italian\",\n    \"it-SM\": \"Italian\",\n    \"it-VA\": \"Italian\",\n    \"iu\": \"Inuktitut\",\n    \"iu-Latn\": \"Inuktitut\",\n    \"ja\": \"Japanese\",\n    \"ja-JP\": \"Japanese\",\n    \"jv\": \"Javanese\",\n    \"ka\": \"Georgian\",\n    \"ki\": \"Kikuyu\",\n    \"kk\": \"Kazakh\",\n    \"kk-Arab\": \"Kazakh\",\n    \"kk-Cyrl\": \"Kazakh\",\n    \"kk-KZ\": \"Kazakh\",\n    \"kl\": \"Kalaallisut\",\n    \"km\": \"Central Khmer\",\n    \"kn\": \"Kannada\",\n    \"kn-IN\": \"Kannada\",\n    \"ko\": \"Korean\",\n    \"ko-CN\": \"Korean\",\n    \"ko-KP\": \"Korean\",\n    \"ko-KR\": \"Korean\",\n    \"ks\": \"Kashmiri\",\n    \"ks-Arab\": \"Kashmiri\",\n    \"ks-Deva\": \"Kashmiri\",\n    \"ku\": \"Kurdish\",\n    \"kw\": \"Cornish\",\n    \"ky\": \"Kyrgyz\",\n    \"la\": \"Latin\",\n    \"lb\": \"Luxembourgish\",\n    \"lg\": \"Ganda\",\n    \"ln\": \"Lingala\",\n    \"ln-AO\": \"Lingala\",\n    \"ln-CF\": \"Lingala\",\n    \"ln-CG\": \"Lingala\",\n    \"lo\": \"Lao\",\n    \"lt\": \"Lithuanian\",\n    \"lt-LT\": \"Lithuanian\",\n    \"lu\": \"Luba-Katanga\",\n    \"lv\": \"Latvian\",\n    \"lv-LV\": \"Latvian\",\n    \"mg\": \"Malagasy\",\n    \"mi\": \"Maori\",\n    \"mk\": \"Macedonian\",\n    \"ml\": \"Malayalam\",\n    \"ml-IN\": \"Malayalam\",\n    \"mn\": \"Mongolian\",\n    \"mn-Mong\": \"Mongolian\",\n    \"mn-Mong-MN\": \"Mongolian\",\n    \"mr\": \"Marathi\",\n    \"mr-IN\": \"Marathi\",\n    \"ms\": \"Malay\",\n    \"ms-Arab\": \"Malay\",\n    \"ms-Arab-BN\": \"Malay\",\n    \"ms-BN\": \"Malay\",\n    \"ms-ID\": \"Malay\",\n    \"ms-SG\": \"Malay\",\n    \"mt\": \"Maltese\",\n    \"my\": \"Burmese\",\n    \"nb\": \"Norwegian Bokm\u00e5l\",\n    \"nb-SJ\": \"Norwegian Bokm\u00e5l\",\n    \"nd\": \"North Ndebele\",\n    \"ne\": \"Nepali\",\n    \"ne-IN\": \"Nepali\",\n    \"nl\": \"Dutch\",\n    \"nl-AW\": \"Dutch\",\n    \"nl-BE\": \"Dutch\",\n    \"nl-BQ\": \"Dutch\",\n    \"nl-CW\": \"Dutch\",\n    \"nl-NL\": \"Dutch\",\n    \"nl-SR\": \"Dutch\",\n    \"nl-SX\": \"Dutch\",\n    \"nn\": \"Norwegian Nynorsk\",\n    \"no\": \"Norwegian\",\n    \"no-NO\": \"Norwegian\",\n    \"nr\": \"South Ndebele\",\n    \"nv\": \"Navajo\",\n    \"ny\": \"Chichewa\",\n    \"oc\": \"Occitan\",\n    \"oc-ES\": \"Occitan\",\n    \"om\": \"Oromo\",\n    \"om-KE\": \"Oromo\",\n    \"or\": \"Oriya\",\n    \"os\": \"Ossetian\",\n    \"os-RU\": \"Ossetian\",\n    \"pa\": \"Punjabi\",\n    \"pa-IN\": \"Punjabi\",\n    \"pa-Arab\": \"Punjabi\",\n    \"pa-Guru\": \"Punjabi\",\n    \"pl\": \"Polish\",\n    \"pl-PL\": \"Polish\",\n    \"ps\": \"Pashto\",\n    \"ps-PK\": \"Pashto\",\n    \"pt\": \"Portuguese\",\n    \"pt-AO\": \"Portuguese\",\n    \"pt-BR\": \"Portuguese\",\n    \"pt-CH\": \"Portuguese\",\n    \"pt-CV\": \"Portuguese\",\n    \"pt-GQ\": \"Portuguese\",\n    \"pt-GW\": \"Portuguese\",\n    \"pt-LU\": \"Portuguese\",\n    \"pt-MO\": \"Portuguese\",\n    \"pt-MZ\": \"Portuguese\",\n    \"pt-PT\": \"Portuguese\",\n    \"pt-ST\": \"Portuguese\",\n    \"pt-TL\": \"Portuguese\",\n    \"qu\": \"Quechua\",\n    \"qu-BO\": \"Quechua\",\n    \"qu-EC\": \"Quechua\",\n    \"rm\": \"Romansh\",\n    \"rn\": \"Rundi\",\n    \"ro\": \"Romanian\",\n    \"ro-MD\": \"Romanian\",\n    \"ro-RO\": \"Romanian\",\n    \"ru\": \"Russian\",\n    \"ru-BY\": \"Russian\",\n    \"ru-KG\": \"Russian\",\n    \"ru-KZ\": \"Russian\",\n    \"ru-MD\": \"Russian\",\n    \"ru-RU\": \"Russian\",\n    \"ru-UA\": \"Russian\",\n    \"rw\": \"Kinyarwanda\",\n    \"sa\": \"Sanskrit\",\n    \"sc\": \"Sardinian\",\n    \"sd\": \"Sindhi\",\n    \"sd-Arab\": \"Sindhi\",\n    \"sd-Deva\": \"Sindhi\",\n    \"se\": \"Northern Sami\",\n    \"se-FI\": \"Northern Sami\",\n    \"se-SE\": \"Northern Sami\",\n    \"sg\": \"Sango\",\n    \"si\": \"Sinhala\",\n    \"sk\": \"Slovak\",\n    \"sk-SK\": \"Slovak\",\n    \"sl\": \"Slovenian\",\n    \"sl-SI\": \"Slovenian\",\n    \"sn\": \"Shona\",\n    \"so\": \"Somali\",\n    \"so-DJ\": \"Somali\",\n    \"so-ET\": \"Somali\",\n    \"so-KE\": \"Somali\",\n    \"sq\": \"Albanian\",\n    \"sq-MK\": \"Albanian\",\n    \"sq-XK\": \"Albanian\",\n    \"sr\": \"Serbian\",\n    \"sr-RS\": \"Serbian\",\n    \"sr-Cyrl\": \"Serbian\",\n    \"sr-Cyrl-BA\": \"Serbian\",\n    \"sr-Cyrl-ME\": \"Serbian\",\n    \"sr-Cyrl-XK\": \"Serbian\",\n    \"sr-Latn\": \"Serbian\",\n    \"sr-Latn-BA\": \"Serbian\",\n    \"sr-Latn-ME\": \"Serbian\",\n    \"sr-Latn-XK\": \"Serbian\",\n    \"ss\": \"Swati\",\n    \"ss-SZ\": \"Swati\",\n    \"st\": \"Southern Sotho\",\n    \"st-LS\": \"Southern Sotho\",\n    \"su\": \"Sundanese\",\n    \"su-Latn\": \"Sundanese\",\n    \"sv\": \"Swedish\",\n    \"sv-AX\": \"Swedish\",\n    \"sv-FI\": \"Swedish\",\n    \"sv-SE\": \"Swedish\",\n    \"sw\": \"Swahili\",\n    \"sw-CD\": \"Swahili\",\n    \"sw-KE\": \"Swahili\",\n    \"sw-TZ\": \"Swahili\",\n    \"sw-UG\": \"Swahili\",\n    \"ta\": \"Tamil\",\n    \"ta-IN\": \"Tamil\",\n    \"ta-LK\": \"Tamil\",\n    \"ta-MY\": \"Tamil\",\n    \"ta-SG\": \"Tamil\",\n    \"te\": \"Telugu\",\n    \"te-IN\": \"Telugu\",\n    \"tg\": \"Tajik\",\n    \"th\": \"Thai\",\n    \"th-TH\": \"Thai\",\n    \"ti\": \"Tigrinya\",\n    \"ti-ER\": \"Tigrinya\",\n    \"tk\": \"Turkmen\",\n    \"tl\": \"Tagalog\",\n    \"tn\": \"Tswana\",\n    \"tn-BW\": \"Tswana\",\n    \"to\": \"Tonga\",\n    \"tr\": \"Turkish\",\n    \"tr-CY\": \"Turkish\",\n    \"tr-TR\": \"Turkish\",\n    \"ts\": \"Tsonga\",\n    \"tt\": \"Tatar\",\n    \"ug\": \"Uyghur\",\n    \"uk\": \"Ukrainian\",\n    \"uk-UA\": \"Ukrainian\",\n    \"ur\": \"Urdu\",\n    \"ur-IN\": \"Urdu\",\n    \"ur-PK\": \"Urdu\",\n    \"uz\": \"Uzbek\",\n    \"uz-Arab\": \"Uzbek\",\n    \"uz-Cyrl\": \"Uzbek\",\n    \"uz-Latn\": \"Uzbek\",\n    \"ve\": \"Venda\",\n    \"vi\": \"Vietnamese\",\n    \"vi-VN\": \"Vietnamese\",\n    \"vo\": \"Volap\u00fck\",\n    \"wa\": \"Walloon\",\n    \"wo\": \"Wolof\",\n    \"xh\": \"Xhosa\",\n    \"yi\": \"Yiddish\",\n    \"yo\": \"Yoruba\",\n    \"yo-BJ\": \"Yoruba\",\n    \"za\": \"Zhuang\",\n    \"zh\": \"Chinese\",\n    \"zh-CH\": \"Chinese\",\n    \"zh-TW\": \"Chinese\",\n    \"zh-Hans\": \"Chinese\",\n    \"zh-Hans-HK\": \"Chinese\",\n    \"zh-Hans-MO\": \"Chinese\",\n    \"zh-Hans-MY\": \"Chinese\",\n    \"zh-Hans-SG\": \"Chinese\",\n    \"zh-Hant\": \"Chinese\",\n    \"zh-Hant-HK\": \"Chinese\",\n    \"zh-Hant-MO\": \"Chinese\",\n    \"zh-Hant-MY\": \"Chinese\",\n    \"zh-Latn\": \"Chinese\",\n    \"zu\": \"Zulu\",\n    \"zu-ZA\": \"Zulu\",\n}\n-%}\n{{ bos_token }}\n{%- if (messages[0]['role'] != 'user') -%}\n    {{ raise_exception(\"Conversations must start with a user prompt.\") }}\n{%- endif -%}\n{%- for message in messages -%}\n    {%- if (message['role'] == 'user') != (loop.index0 % 2 == 0) -%}\n        {{ raise_exception(\"Conversation roles must alternate user/assistant/user/assistant/...\") }}\n    {%- endif -%}\n    {%- if (message['role'] == 'assistant') -%}\n        {%- if message['content'] is none or message['content'] is not string -%}\n            {{ raise_exception(\"Assistant role must provide content as a string\") }}\n        {%- endif -%}\n        {{ '<start_of_turn>model\\n'}}\n        {{ message[\"content\"] | trim }}\n    {%- elif (message['role'] == 'user') -%}\n        {%- if message['content'] is none or message['content'] is not iterable or message['content'] | length != 1 -%}\n            {{ raise_exception(\n                \"User role must provide `content` as an iterable with exactly one item. That item must be a \" +\n                \"`mapping(type:'text' | 'image', source_lang_code:string, target_lang_code:string, \" +\n                \"text:string | none, image:string | none)`.\"\n            ) }}\n        {%- endif -%}\n        {%- set content = message[\"content\"][0] -%}\n        {%- set source_lang_code = content[\"source_lang_code\"] | replace(\"_\", \"-\")  -%}\n        {%- set source_lang = languages[source_lang_code] -%}\n        {%- set target_lang_code = content[\"target_lang_code\"] | replace(\"_\", \"-\") -%}\n        {%- set target_lang = languages[target_lang_code] -%}\n        {{ '<start_of_turn>user\\nYou are a professional ' + source_lang + ' (' + source_lang_code + ') to ' +\n           target_lang + ' (' + target_lang_code + ') translator. Your goal is to accurately convey the meaning and '\n           'nuances of the original ' + source_lang + ' text while adhering to ' + target_lang + ' grammar, '\n           'vocabulary, and cultural sensitivities.\\n'\n        }}\n        {%- if content[\"type\"] == 'text' -%}\n            {{\n                'Produce only the ' + target_lang + ' translation, without any additional explanations or ' +\n                'commentary. Please translate the following ' + source_lang + ' text into ' + target_lang + ':\\n\\n\\n' +\n                content[\"text\"] | trim\n            }}\n        {%- elif content[\"type\"] == 'image' -%}\n            {{\n                'Please translate the ' + source_lang + ' text in the provided image into ' + target_lang + '. ' +\n                'Produce only the ' + target_lang + ' translation, without any additional explanations, ' +\n                'alternatives or commentary. Focus only on the text, do not output where the text is located, ' +\n                'surrounding objects or any other explanation about the picture. Ignore symbols, pictogram, and ' +\n                'arrows!\\n\\n\\n<start_of_image>'\n            }}\n        {%- else -%}\n            {{ raise_exception(\"User role `content` can contain either `text` or `image` data.\") }}\n        {%- endif -%}\n    {%- else -%}\n        {{ raise_exception(\"Conversations must only contain user or assistant roles.\") }}\n    {%- endif -%}\n    {{ '<end_of_turn>\\n' }}\n{%- endfor -%}\n{%- if add_generation_prompt -%}\n    {{'<start_of_turn>model\\n'}}\n{%- endif -%}\n"
}